11/data/attachments/1ee3c66cf8b706a1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7fb622e7-19d7-4578-9585-8a3d2f768098</nif:username>
            <nif:friendToBeAdded>Ana_attack_Friend_59445_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>